In [5]:
import numpy as np
import pandas as pd

In [6]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [7]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [8]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop'])

In [9]:
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [10]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop'], index=['A','B','C','D','E','F'])

In [11]:
frame

   year   state  pop
A  2000    Ohio  1.5
B  2001    Ohio  1.7
C  2002    Ohio  3.6
D  2001  Nevada  2.4
E  2002  Nevada  2.9
F  2003  Nevada  3.2

In [12]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop','debt'], index=['one', 'two', 'three', 'four','five', 'six'])
frame

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [13]:
frame.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [14]:
frame.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [15]:
frame.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [16]:
frame.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [17]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [18]:
frame.debt = val
frame

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [19]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [24]:
frame3=pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [25]:
frame2 = pd.DataFrame(pop, index=[2001, 2002, 2003])
frame2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [26]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}
frame4 = pd.DataFrame(pdata)
frame4

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [27]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [28]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

# Reindexing on Series

In [29]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [30]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [31]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [32]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [33]:
obj3.reindex(range(6), method='ffill')   #ffil>>forwad fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [34]:
obj3.reindex(range(6), method='bfill')   #bfill>>backward fill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

# Reindexing on Dataframe

In [35]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
        index=['a', 'c', 'd'],
        columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [36]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [37]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [38]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [39]:
frame2.reindex(index=['f','b','a','d','c','g'],columns=['Texas','Newyork','Utah','California','Bay'])

   Texas  Newyork  Utah  California  Bay
f    NaN      NaN   NaN         NaN  NaN
b    NaN      NaN   NaN         NaN  NaN
a    1.0      NaN   NaN         2.0  NaN
d    7.0      NaN   NaN         8.0  NaN
c    4.0      NaN   NaN         5.0  NaN
g    NaN      NaN   NaN         NaN  NaN

In [40]:
frame4 = pd.DataFrame(np.arange(1,101).reshape((20,5)),columns=list('abcde'),index=range(1,101,5))
frame4

     a   b   c   d    e
1    1   2   3   4    5
6    6   7   8   9   10
11  11  12  13  14   15
16  16  17  18  19   20
21  21  22  23  24   25
26  26  27  28  29   30
31  31  32  33  34   35
36  36  37  38  39   40
41  41  42  43  44   45
46  46  47  48  49   50
51  51  52  53  54   55
56  56  57  58  59   60
61  61  62  63  64   65
66  66  67  68  69   70
71  71  72  73  74   75
76  76  77  78  79   80
81  81  82  83  84   85
86  86  87  88  89   90
91  91  92  93  94   95
96  96  97  98  99  100

In [41]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [44]:
frame2.loc['c']

Ohio          3.0
Texas         4.0
California    5.0
Name: c, dtype: float64

In [45]:
frame2.loc['c']['California']

5.0

In [46]:
frame2.loc['c'][2]

5.0

In [47]:
frame2.loc[::-1]

   Ohio  Texas  California
d   6.0    7.0         8.0
c   3.0    4.0         5.0
b   NaN    NaN         NaN
a   0.0    1.0         2.0

In [48]:
frame2.loc[::-1,::-1]

   California  Texas  Ohio
d         8.0    7.0   6.0
c         5.0    4.0   3.0
b         NaN    NaN   NaN
a         2.0    1.0   0.0

In [49]:
frame2.loc['a':'c']   #loc[start:end]

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0

In [50]:
frame2.iloc[:2]    #iloc[start:end-1]

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN

In [51]:
frame2.loc[['a','d','b']]

   Ohio  Texas  California
a   0.0    1.0         2.0
d   6.0    7.0         8.0
b   NaN    NaN         NaN

In [52]:
frame2.loc['b']['Ohio'] = 2
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   2.0    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [53]:
frame2.loc['b'][[0,2]] =  [4,6]
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   4.0    NaN         6.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [54]:
frame2.loc['b'][[2,0]] = frame2.loc['b'][[0,2]]
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   6.0    NaN         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [55]:
frame2['Texas'][1] + 5

nan

In [56]:
frame4 = frame2.copy()
frame4

   Ohio  Texas  California
a   0.0    1.0         2.0
b   6.0    NaN         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [57]:
frame4['std'] = [5,6,7,8]
frame4

   Ohio  Texas  California  std
a   0.0    1.0         2.0    5
b   6.0    NaN         4.0    6
c   3.0    4.0         5.0    7
d   6.0    7.0         8.0    8

In [58]:
frame2 + frame4

   California  Ohio  Texas  std
a         4.0   0.0    2.0  NaN
b         8.0  12.0    NaN  NaN
c        10.0   6.0    8.0  NaN
d        16.0  12.0   14.0  NaN